{
  "answer": "",
  "id": 0,
  "text": [
    "Disclaimer: This website is strictly for Canadian users and is for educational and entertainment purposes only. We are not financial advisors, and the content should not be considered professional financial advice. The content is designed to be simple and may not meet everyone's financial needs or goals. Please note that the website is still in development, and content may change. Consult a certified financial professional before making any financial decisions."
  ],
  "responses": [
    {
      "answer": "I have read and understand the above",
      "id": 1,
      "text": [
        "Do you want to make more money?",
        "Money is necessary for everyone to have",
        "It is used to exchange for goods and services",
        "Having more money allows you to purchase more goods and services"
      ],
      "responses": [
        {
          "answer": "yes",
          "id": 2,
          "text": [
            "Do you have any debt?",
            "Debt is when you borrow money and have to pay it back later",
            "In most cases, you have to pay back regular payments with an extra added on top",
            "The extra money on top of how much you borrowed is called interest",
            "The original amount is often called the principal",
            "The interest rate is the percentage of interest you pay for a given time period in relation to the principal",
            "A higher interest rate means you pay back more on top of the original amount you borrowed",
            "Different parties will lend money for different uses at different rates",
            "Debt with an interest rate above 10 percent is commonly considered high interest debt",
            "Debt with an interest rate below 10 percent is commonly not considered high interest debt"
          ],
          "responses": [
            {
              "answer": "Yes, credit card debt or other high interest debt (rate above 10 percent)",
              "id": 11,
              "text": [
                "Yikes! High-interest debt can snowball quickly! I would pay that off right away!",
                "Usual credit card debt has a rate between 10-15 percent",
                "This is quite high and is difficult to overcome",
                "The longer it is left to compound, the more it builds upon itself",
                "Compounding is when something builds upon itself",
                "For example, the first year the 100 dollars you owe becomes 110 at 10 percent interest",
                "Because of compounding the second year would be 121 dollars instead of 120",
                "This might seem small at first but over a time it builds up significantly",
                "Because of this, credit card debt should be eliminated before taking any other steps with your finances",
                "It is a big priority",
                "It doesn't make sense to even build savings because you are playing a losing game",
                "This is because you will be saving slower than the amount you owe grows",
                "You can think of it as trying to fill a bucket with a hole in the bottom",
                "To eliminate credit card debt there are a lot of different strategies you can use",
                "First and foremost, you should stop any use of your credit card",
                "Getting into more debt will make your journey towards financial freedom that much more difficult",
                "One method could be to dedicate a portion of your income to go towards paying off the debt"
              ],
              "responses": [
                {
                  "answer": "I paid off my credit card debt",
                  "connectId": 3,
                  "id": 12,
                  "text": [],
                  "responses": []
                }
              ]
            },
            {
              "answer": "Yes, it is not high-interest and I can afford the payments (rate below 10 percent)",
              "connectId": 3,
              "id": 13,
              "text": [],
              "responses": []
            },
            {
              "answer": "No",
              "id": 3,
              "text": [
                "That's great! Do you have extra money after regular expenses?",
                "You may have more extra money after regular expenses than you think",
                "A good way to figure it out is to first write out all your regularly occuring expenses that are mandatory",
                "Be extra strict when it comes to what you consider mandatory with this first step only include expenses you can't live without",
                "Don't worry you'll still have spending money after",
                "Now with this amount for your mandatory expenses, subtract it from your income",
                "For example, if your monthly mandatory expenses are 3500 and your income is 4000, 4000-3500=500",
                "Now out of this amount I would consider 50% of it to be extra money, though it varies from person to person",
                "If your 50% isn't zero then answer Yes down below",
                "I know you might not consider this extra money, but we will call it that just for our purposes"
              ],
              "responses": [
                {
                  "answer": "Yes",
                  "id": 4,
                  "text": [
                    "Fantastic! Do you have about 6 months worth of living expenses saved up?",
                    "Having 6 months worth of living expenses is a good first goal to have for your personal finances",
                    "This amount is intended to be kept in a secure account with a reputable bank and be left relatively untouched",
                    "It should also grow slowly from the accounts interest rate as an added bonus",
                    "The point of this sum of money isn't for growth though",
                    "This sum is intended as an emergency fund in case something unexpected happens and you find yourself in a difficult financial situation",
                    "This could be something like being laid off from work",
                    "Normally, you'd be in a difficult position without your main income source, but because of this 6 months worth of expenses saved up, you don't have to worry for the next 6 months",
                    "When deciding what is a good account for you to put your money in it can be overwhelming with all the options",
                    "A good account should meet a few criteria",
                    "First, it should be from a reputable firm, this could mean it's large or it's been around for a while",
                    "Second, it should be CDIC covered, this means the government protects up to $100,000 in deposits in case anything happens to the bank providing the account",
                    "Thirdly, there should be no fees for using the savings account, with so many no-fee accounts out there, there's no need for the average person to pay for one",
                    "Lastly, it should have the highest interest rate possible",
                    "How interest rate is so hurtful when it comes to debt, works in the opposite way when it comes to your own savings account",
                    "A good account that meets these requirements is the Wealthsimple Cash account, an easy account you can manage all from your phone"
                  ],
                  "responses": [
                    {
                      "answer": "Yes",
                      "id": 5,
                      "text": ["Great! Now when do you want even more money?"],
                      "responses": [
                        {
                          "answer": "I'd want the money within the next five years",
                          "id": 14,
                          "text": [
                            "I'd continue contributing to your savings account until you feel comfortable taking on risk for long-term reward",
                            "In order to earn higher rates of return, higher risk is needed",
                            "However, this risk is greatly reduced with time",
                            "Because of this, money that you need short term should be put into guaranteed investments",
                            "A high interest savings account with no fees is a good option for this",
                            "When deciding what is a good account for you to put your money in it can be overwhelming with all the options",
                            "A good account should meet a few criteria",
                            "First, it should be from a reputable firm, this could mean it's large or it's been around for a while",
                            "Second, it should be CDIC covered, this means the government protects up to $100,000 in deposits in case anything happens to the bank providing the account",
                            "Thirdly, there should be no fees for using the savings account, with so many no-fee accounts out there, there's no need for the average person to pay for one",
                            "Lastly, it should have the highest interest rate possible",
                            "How interest rate is so hurtful when it comes to debt, works in the opposite way when it comes to your own savings account",
                            "A good account that meets these requirements is the Wealthsimple Cash account, an easy account you can manage all from your phone",
                            "Alternatively, you can invest in other guaranteed financial instruments",
                            "These include GICs and Treasury Bonds",
                            "GICs (Guaranteed Investment Certificates) are investments where you lend money to a financial institution for a fixed term and earn a guaranteed interest rate.",
                            "There are a couple things to note with GICs",
                            "You are unable to get the money you invest back until the time period is over",
                            "There is a guaranteed amount of interest you will receive",
                            "This makes GICs enticing in scenarios where you want a guaranteed amount of money a certain amount of time into the future",
                            "Many different financial institutions offer various rates and time periods",
                            "If you find one that has a particularly high rate (higher than your savings account rate) and has a time frame that works for you, it could be a safe way to make some money",
                            "Treasury bonds are low risk investments where you lend money to the government and earn interest until they pay you back in full later",
                            "You can buy them through financial institutions or directly from the government",
                            "To buy directly from the Government of Canada you can go via the Canada Savings Bonds (CSB) website or the Government of Canada Investment Account",
                            "To decide between the options I've mentioned, go with what works for your time frame and gives you the best returns",
                            "To keep it simple, you can always just stick to contributing to your savings account",
                            "If you are saving for a particular goal within the next few year, some financial institutions allow you to open savings accounts with different labels",
                            "For example, Wealthsimple allows you to open as many Cash accounts as you'd like at no fee",
                            "From there you can label them accordingly",
                            "For example, at this point you should have your six months worth of living expenses saved up",
                            "You could keep this in an account called 'Emergency Fund'",
                            "Then you could open another account for whatever you're looking to spend in the next few years",
                            "If it was a car for example, you could open another account and call it 'Car Fund'",
                            "Then month by month contribute to this account and build it until you are able to buy what you're working towards",
                            "If you don't need money for within the next five years, beyond your six month fund and your regular expenses, then you can take on riskier investments for greater returns"
                          ],
                          "responses": [
                            {
                              "answer": "I got all the money I need for now, I can wait more than five years",
                              "connectId": 6,
                              "id": 15,
                              "text": [],
                              "responses": []
                            }
                          ]
                        },
                        {
                          "answer": "I got all the money I need for now, I can wait more than five years",
                          "id": 6,
                          "text": [
                            "Calculate your TFSA contribution room, if you have room then I would buy a few different ETFs and continue investing into them"
                          ],
                          "responses": [
                            {
                              "answer": "I maxed out my TFSA and have more money to invest",
                              "id": 7,
                              "text": ["What are you saving for now?"],
                              "responses": [
                                {
                                  "answer": "My child's education",
                                  "id": 8,
                                  "text": [
                                    "Calculate your RESP contribution room. If you have room, then I would buy a few different ETFs and continue investing in them."
                                  ],
                                  "responses": [
                                    {
                                      "answer": "I maxed out my RESP and have more money to invest",
                                      "connectId": 7,
                                      "id": 16,
                                      "text": [],
                                      "responses": []
                                    }
                                  ]
                                },
                                {
                                  "answer": "My retirement",
                                  "id": 17,
                                  "text": [
                                    "You can check your RRSP contribution limit online by setting up an account with the CRA. You can also call the CRA at 1-800-267-6999. If you have room, then I would buy a few different ETFs and continue investing in them."
                                  ],
                                  "responses": [
                                    {
                                      "answer": "I maxed out my RRSP and have more money to invest",
                                      "connectId": 7,
                                      "id": 18,
                                      "text": [],
                                      "responses": []
                                    }
                                  ]
                                },
                                {
                                  "answer": "I just want more money",
                                  "id": 9,
                                  "text": [
                                    "Do you want to risk it for the biscuit or get some steady reliable income?"
                                  ],
                                  "responses": [
                                    {
                                      "answer": "Risk it for the biscuit",
                                      "id": 10,
                                      "text": [
                                        "I think you're ready to open a non-registered investment account to continue investing in ETFs."
                                      ],
                                      "responses": [
                                        {
                                          "answer": "What next?",
                                          "id": 19,
                                          "text": [
                                            "Congratulations, you seem to have a great portfolio! I don't have any more tips for you at this time."
                                          ],
                                          "responses": []
                                        }
                                      ]
                                    },
                                    {
                                      "answer": "Play it safe",
                                      "id": 20,
                                      "text": [
                                        "I'd continue contributing to your savings account until you feel comfortable taking on risk for long-term reward."
                                      ],
                                      "responses": [
                                        {
                                          "answer": "I'm ready to take on some more risk for more long-term reward",
                                          "connectId": 10,
                                          "id": 21,
                                          "text": [],
                                          "responses": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "answer": "No",
                      "id": 22,
                      "text": [
                        "Having about 6 months worth of living expenses saved up is a great step towards financial freedom. I would dedicate a portion of my income to regularly be deposited into a high-interest savings account. I've found that the Wealthsimple Cash account is the highest-interest account with no fees."
                      ],
                      "responses": [
                        {
                          "answer": "I've saved up about 6 months worth of living expenses!",
                          "connectId": 5,
                          "id": 23,
                          "text": [],
                          "responses": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "answer": "No",
                  "id": 24,
                  "text": [
                    "Before you're sure that you don't have extra money, go back to the previous page and use the dialogue arrow to hear me out on what I am referring to as extra money",
                    "If you've gone back and you're sure you don't have extra money then it's going to be a priority for you to change this situation",
                    "Some ways I would get more money would be to cut back on spending, finding more income streams, or increasing your existing income streams",
                    "A good way to find where you can improve your situation to have extra money is to write it all out",
                    "Write out your mandatory expenses that you can't live without then write out your other regularly occuring expenses",
                    "Also write out all your income streams",
                    "With these numbers, consider your situation",
                    "Do you have regularly occuring expenses that you can cut back on until you're in a better financial situation?",
                    "Be honest with yourself and consider the fact that putting yourself in a good position right now will allow much more freedom in the future",
                    "Also consider if you can improve your income stream somehow",
                    "Maybe take on extra hours or a side job",
                    "Once again keep in mind that if you want freedom in the future you're going to need to make some sacrifices right now"
                  ],
                  "responses": [
                    {
                      "answer": "I've found extra money!",
                      "connectId": 4,
                      "id": 25,
                      "text": [],
                      "responses": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "answer": "no",
          "id": 26,
          "text": ["Well, that's no good"],
          "responses": [
            {
              "answer": "I do want to make more money actually",
              "connectId": 2,
              "id": 27,
              "text": [],
              "responses": []
            }
          ]
        }
      ]
    }
  ]
}
